README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<title>my_help README</title>
<!-- 2018-04-30 月 11:24 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">my_help README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#">1. 概要</a></li>
<li><a href="#my_help">2. (my_helpで解決しようとする)問題点</a></li>
<li><a href="#">3. 特徴</a></li>
<li><a href="#">4. 使用法</a>
<ul>
<li><a href="#sec-4-1">4.1. インストール</a></li>
<li><a href="#">4.2. 簡単な使用法</a></li>
<li><a href="#help">4.3. 独自のhelpを作る方法</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-概要" class="outline-2">
<h2 id="概要"><a id="sec-1" name="sec-1"></a><span class="section-number-2">1</span> 概要</h2>
<div class="outline-text-2" id="text-概要">

<p>
CUI(CLA)ヘルプのUsage出力を真似て，user独自のhelpを作成・提供するgem.
</p>
</div>
</div>


<div id="outline-container-my_helpで解決しようとする問題点" class="outline-2">
<h2 id="my_helpで解決しようとする問題点"><a id="sec-2" name="sec-2"></a><span class="section-number-2">2</span> (my_helpで解決しようとする)問題点</h2>
<div class="outline-text-2" id="text-my_helpで解決しようとする問題点">

<p>
CUIやshell, 何かのプログラミング言語などを習得しようとする初心者は，
commandや文法を覚えるのに苦労します．少しのkey(とっかかり)があると
思い出すんですが，うろ覚えでは間違えて路頭に迷います．問題点は， 
</p>
<ul class="org-ul">
<li>manは基本的に英語 
</li>
<li>manualでは重たい 
</li>
<li>いつもおなじことをwebで検索して 
</li>
<li>同じとこ見ている 
</li>
<li>memoしても，どこへ置いたか忘れる
</li>
</ul>
<p>
などです．
</p>
</div>
</div>

<div id="outline-container-特徴" class="outline-2">
<h2 id="特徴"><a id="sec-3" name="sec-3"></a><span class="section-number-2">3</span> 特徴</h2>
<div class="outline-text-2" id="text-特徴">

<p>
これらをCLA環境として提供しようというのが，このgemの目的です．
仕様としては， 
</p>
<ul class="org-ul">
<li>userが自分にあったmanを作成 
</li>
<li>雛形を提供 
</li>
<li>おなじformat, looks, 操作, 階層構造 
</li>
<li>すぐに手が届く 
</li>
<li>それらを追加・修正・削除できる
</li>
</ul>

<p>
memoソフトでは，検索が必要となりますが，my_helpは
key(記憶のとっかかり)を提供することが目的です．
RPGでレベル上げとかアイテムを貯めるようにして，
プログラミングでスキルを発展させてください．
</p>

<p>
物覚えの悪い作者は，人の名前をitem分けして，こそっと使っています．
</p>
</div>
</div>

<div id="outline-container-使用法" class="outline-2">
<h2 id="使用法"><a id="sec-4" name="sec-4"></a><span class="section-number-2">4</span> 使用法</h2>
<div class="outline-text-2" id="text-使用法">
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> インストール</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="example">
$ gem install my_help
</pre>
<p>
です．
</p>
</div>
</div>

<div id="outline-container-簡単な使用法" class="outline-3">
<h3 id="簡単な使用法"><a id="sec-4-2" name="sec-4-2"></a><span class="section-number-3">4.2</span> 簡単な使用法</h3>
<div class="outline-text-3" id="text-簡単な使用法">

<p>
まずは，
</p>
<pre class="example">
&gt; my_help
NAME
    my_help - make own help and list.

SYNOPSIS
    my_help [global options] command [command options] [arguments...]

VERSION
    0.7.0

GLOBAL OPTIONS
    --help    - Show this message
    --version - Display the program version

COMMANDS
    delete - delete HELP_NAME help
    edit   - edit HELP_NAME help
    help   - Shows a list of commands or help for one command
    list   - list all helps, specific HELP, or item
     new   - make new HELP_NAME
</pre>
<p>
としてください．このlistにargsやitemを加えて行くとわかると思います．
</p>

<pre class="example">
my_help list
my_help list emacs_help
my_help list emacs_help -f
my_help list emacs_help file
</pre>
<p>
として動かしてみてください．
</p>


<pre class="example">
- emacsのキーバインド
- 
特殊キー操作
-   C-f, controlキーを押しながら    'f'
-   M-f, escキーを押した後一度離して'f'
-     操作の中断C-g, 操作の取り消し(Undo) C-x u
     , head           : head
     , license        : license
   -c, cursor         : cursor
   -e, edit           : edit
   -s, short_cut      : short_cut
   -f, file           : file
   -q, quit           : quit
   -p, page           : page
   -w, window         : window
   -b, buffer         : buffer
   -m, mode           : mode
     , query_replace  : query_replace
   -r, ruby-mode      : ruby-mode
   -d, dired          : ファイラとして使う
</pre>
</div>
</div>

<div id="outline-container-独自のhelpを作る方法" class="outline-3">
<h3 id="独自のhelpを作る方法"><a id="sec-4-3" name="sec-4-3"></a><span class="section-number-3">4.3</span> 独自のhelpを作る方法</h3>
<div class="outline-text-3" id="text-独自のhelpを作る方法">

<p>
さて，独自のhelpを作る方法です．まずは，
</p>

<pre class="example">
my_help new new_help
</pre>

<p>
で，new_helpというtemplateが用意されます．
</p>
<pre class="example">
my_help edit new_help
</pre>
<p>
で編集してください． emacs org形式で，格納されています．
</p>

<pre class="example">
my_help delete new_help
</pre>

<p>
すると消されます．
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2018-04-30 月 11:24</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
